<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'ชื่อ',
    'column.guard_name' => 'ประเภท',
    'column.roles' => 'กลุ่มสิทธิ',
    'column.permissions' => 'สิทธิการเข้าถึง',
    'column.updated_at' => 'อัปเดตเมื่อ',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'ชื่อ',
    'field.guard_name' => 'ประเภท',
    'field.permissions' => 'สิทธิการเข้าถึง',
    'field.select_all.name' => 'เลือกทั้งหมด',
    'field.select_all.message' => 'เปิดใช้งานการอนุญาตทั้งหมดในปัจจุบัน <span class="text-primary font-medium">เปิดใช้งานแล้ว</span>สำหรับบทบาทนี้',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'ตั้งค่าระบบ',
    'nav.role.label' => 'กลุ่มสิทธิ',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'กลุ่มสิทธิ',
    'resource.label.roles' => 'กลุ่มสิทธิ',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'Entities',
    'resources' => 'Resources',
    'widgets' => 'Widgets',
    'pages' => 'Pages',
    'custom' => 'Custom Permissions',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'You do not have permission to access',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'ดูรายละเอียด',
        'view_any' => 'เรียกดู',
        'create' => 'เพิ่ม',
        'update' => 'แก้ไข',
        'delete' => 'ลบ',
        'delete_any' => 'ลบทุกส่วน',
        'force_delete' => 'บังคับลบ',
        'force_delete_any' => 'บังคับลบทุกส่วน',
        'restore' => 'ย้อนกลับ',
        'reorder' => 'เรียงลำดับ',
        'restore_any' => 'ย้อนกลับทุกส่วน',
        'replicate' => 'ทำซ้ำ',
    ],
];
