<div class="text-left mt-10 grid grid-cols-2 m-5">
    <div>
        ลงชื่อ <span>....................</span> ผู้รับการประเมิน
        <br>
        (.........................................)
    </div>
    <div>
        ลงชื่อ <span >....................</span> ผู้บังคับบัญชาชั้นต้น
        <br>
        (.........................................)
    </div>
</div>
<div class="text-left grid grid-cols-2 m-5">
    <div>
        ตำแหน่ง <span>....................</span>
        <br>
        ........./........./..........
    </div>
    <div>
        ตำแหน่ง <span >....................</span>
        <br>
        ........./........./..........
    </div>
</div>
